#!/usr/bin/env python
# coding: utf-8

# In[1]:


#練習 0201

s="因葉益成（已歿）積欠伊賭債新臺幣（下同）60萬元，交付楊清弦美製貝瑞塔手槍1支、美製史密斯手槍1支、制式口徑9mm子彈26顆 、土造金屬子彈1顆、仿美國COLT廠M1911A1型半自動手槍1支、口徑0.45吋制式子彈1顆，而未經許可而持有之。"

l=s.split("，")
del l[0]
del l[1]
print(l)

ll=l[0].split("、")
print(ll)

del ll[0]
ll.insert(0,"美製貝瑞塔手槍1支")
print(ll)


# In[2]:


#練習 0202

t1="最高法院民事判例","最高法院刑事判例","行政法院判例","大法官解釋"
t2=7,3,5,4

t3=t1[:3]
print(t3)

z=zip(t3,t2)
print(list(z))


# In[3]:


#練習 0203

y={"有期徒刑","沒收","罰金"}
n={"無期徒刑","罰金","褫奪公權"}

print(y|n)

print(y-n)

print(y&n)
print("罰金" in y)
print("罰金" in n)


# In[4]:


#練習 0204

d={"刑事訴訟法":["第159條之4","第159條之5","第159條之1","第267條","第299條第1項","第302條第1款"],
   "中華民國刑法":["第11條","第38條第1項第1款","第42條第3項","第55條","第56條","第57條","第59條"]}


l1=list(d.keys())
print(l1)
l2=list(d.values())
print(l2)


print(d["刑事訴訟法"][3])

d["中華民國刑法"]=["第11條","第38條第1項第1款","第42條第3項","第55條","第56條","第57條","第59條","第62條"]
print(d)


# In[ ]:




